Revit 2027 API
PerformanceAdviserRuleId.Equality Operator
Compares two PerformanceAdviserRuleId instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator ==(
	PerformanceAdviserRuleId first,
	PerformanceAdviserRuleId second
)
Public Shared Operator = (
	first As PerformanceAdviserRuleId,
	second As PerformanceAdviserRuleId
) As Boolean
public:
static bool operator ==(
	PerformanceAdviserRuleId^ first,
	PerformanceAdviserRuleId^ second
)
static let inline (=)
        first : PerformanceAdviserRuleId *
        second : PerformanceAdviserRuleId  : bool
Parameters
first PerformanceAdviserRuleId
The first PerformanceAdviserRuleId.
second PerformanceAdviserRuleId
The second PerformanceAdviserRuleId.
Return Value
Boolean
True if the inputs are identical, false if they are different.
See Also
Reference
PerformanceAdviserRuleId Class
Autodesk.Revit.DB Namespace